Tekla.Structures.Plugins.InputObjectDependencyAttribute
The InputObjectDependencyAttribute class is used for storing an input object dependency which determines when the plug-in is updated in the system.
The attribute is initialized from the custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] in the plug-in source.

Tekla.Structures.Plugins.InputObjectDependencyAttribute.#ctor(Tekla.Structures.Plugins.PluginBase.InputObjectDependency)
The custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] uses this to store a dependency attribute which determines when the plug-in is updated in the system.
This is not to be used by itself.
Type: The type of the input object dependency.

Tekla.Structures.Plugins.InputObjectDependencyAttribute.Type
Returns the type of the input object dependency.

Tekla.Structures.Plugins.InputObjectDependencyAttribute.#ctor(System.Int32)
The custom attribute [InputObjectDependency(PluginBase.InputObjectDependency Type)] uses this to store a dependency attribute which determines when the plug-in is updated in the system.
This is not to be used by itself.
Type: The type of the input object dependency as an integer.